Summary:

```bash
gem install terraspace
gem install terraspace_plugin_aws
```

Edit `lib\terraspace\cli\setup\check.rb`:
```ruby
    def terraform_bin
      out = "is terraform.exe".strip
      # return unless $?.success?
      md = out.match(/is (.*)/)
      md[1] if md
    end
    memoize :terraform_bin
```

```bash
terraspace new project infra --examples
```

```bash
PS C:\Work\Terraspace\terratest\infra> terraspace up demo      
The system cannot find the path specified.
WARN: The command 'file' is not installed.
Unable to check if files are text or binary files as a part of the Terraspace compile processing.
Assuming all files are not binary file.

Please install the file command to remove this warning message.
Building .terraspace-cache/eu-central-1/dev/stacks/demo
The system cannot find the path specified.
The system cannot find the path specified.
The system cannot find the path specified.
The system cannot find the path specified.
The system cannot find the path specified.
The system cannot find the path specified.
The system cannot find the path specified.
The system cannot find the path specified.
Built in .terraspace-cache/eu-central-1/dev/stacks/demo
Current directory: .terraspace-cache/eu-central-1/dev/stacks/demo
Creating bucket: terraform-state-xxxxxxx-eu-central-1-dev
Creating dynamodb table: terraform_locks
Waiting for dynamodb table to finish creating...
=> terraform init -get -input=false >> /tmp/terraspace/log/init/demo.log
=> terraform apply -input=false

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create


Terraform will perform the following actions:

  # random_pet.this will be created
  + resource "random_pet" "this" {
      + id        = (known after apply)
      + length    = 2
      + separator = "-"
    }
  # module.bucket.aws_s3_bucket.this will be created
  + resource "aws_s3_bucket" "this" {
      + acceleration_status                  = (known after apply)
      + acl                                  = (known after apply)
      + arn                                  = (known after apply)
      + bucket                               = (known after apply)
      + bucket_domain_name                   = (known after apply)
      + bucket_regional_domain_name          = (known after apply)
      + cors_rule                            = (known after apply)
      + force_destroy                        = false
      + grant                                = (known after apply)
      + hosted_zone_id                       = (known after apply)
      + id                                   = (known after apply)
      + lifecycle_rule                       = (known after apply)
      + logging                              = (known after apply)
      + policy                               = (known after apply)
      + region                               = (known after apply)
      + replication_configuration            = (known after apply)
      + request_payer                        = (known after apply)
      + server_side_encryption_configuration = (known after apply)
      + tags_all                             = (known after apply)
      + versioning                           = (known after apply)
      + website                              = (known after apply)
      + website_domain                       = (known after apply)
      + website_endpoint                     = (known after apply)

      + object_lock_configuration {
          + object_lock_enabled = (known after apply)
          + rule                = (known after apply)
        }
    }
  # module.bucket.aws_s3_bucket_acl.this will be created
  + resource "aws_s3_bucket_acl" "this" {
      + acl    = "private"
      + bucket = (known after apply)
      + id     = (known after apply)

      + access_control_policy {
          + grant {
              + permission = (known after apply)

              + grantee {
                  + display_name  = (known after apply)
                  + email_address = (known after apply)
                  + id            = (known after apply)
                  + type          = (known after apply)
                  + uri           = (known after apply)
                }
            }

          + owner {
              + display_name = (known after apply)
              + id           = (known after apply)
            }
        }
    }

Plan: 3 to add, 0 to change, 0 to destroy.

Changes to Outputs:
  + bucket_name = (known after apply)

Do you want to perform these actions?
  Terraform will perform the actions described above.
  Only 'yes' will be accepted to approve.

  Enter a value: yes
random_pet.this: Creating...
random_pet.this: Creation complete after 0s [id=adapted-piranha]
module.bucket.aws_s3_bucket.this: Creating...
module.bucket.aws_s3_bucket.this: Creation complete after 1s [id=bucket-adapted-piranha]
module.bucket.aws_s3_bucket_acl.this: Creating...
module.bucket.aws_s3_bucket_acl.this: Creation complete after 1s [id=bucket-adapted-piranha,private]

Apply complete! Resources: 3 added, 0 changed, 0 destroyed.


Outputs:

bucket_name = "bucket-adapted-piranha"
Time took: 19s
PS C:\Work\Terraspace\terratest\infra> aws s3 ls
2022-02-16 20:51:11 bucket-adapted-piranha
```

Seems ok?